from .models import Receipt

recipes = [
    {
        "title": "Парфе с ягодами и сливками.",
        "ingredients_list": [
            ("Йогурт", 200, 180, 50),
            ("Сливки", 100, 90, 100),
            ("Ягоды", 150, 150, 120),
            ("Мёд", 50, 50, 80),
            ("Мюсли", 60, 60, 40)
        ]
    },
    {
        "title": "Ерундопель - Запечённое лакомство с секретом.",
        "ingredients_list": [
            ("Творог", 250, 230, 180),
            ("Сметана", 100, 95, 80),
            ("Яйца", 2, 2, 50),  
            ("Сахар", 80, 80, 40),
            ("Мука", 100, 100, 90),
            ("Ванилин", 1, 1, 5)  
        ]
    }
]

recipes = [Receipt(recipe["title"], recipe["ingredients_list"]) for recipe in recipes]
